<?php

// Циклы

$mas = array(1, 2, 3 ,4 ,5); // устарело

//$mas = [1, 2, '6' ,  ['Jktcz', '12', [12, 'олололо', [8, 12, 34]    ]   ]   ]; // так делают правильно

//$students = ['мальчики' => ['Зайцев', 'Воробьев' ],   'девочки' => [' Туркова', 'Зиновьева']  ];
$students = ['Марка' => 'тойота', 'Модель' => 'Allex', 'год' => 2005  ];

//echo $students['мальчики'][1];
//echo $students['Марка'] . ' ' . $students['Модель'];


// Список студентов
//$students = [
//    'IS31' => 'Зиновьева', 'Зайцев', 'Шарамченко',
//    'IS32' => ''
//];





//$numbers = [3, 14, 5 , 67, 43];
//asort($numbers); // Функции сортировки sort(), asort(), http://php.net/manual/ru/array.sorting.php
//echo $numbers[2];



//Циклы

// предусловие сперва проверяет условие, затем выполняет код
//while (1==1) { // условие
//    echo 'jkjkj'; // что выполнить, если условие выполняется
//    break; // остановить цикл
//}

// пример

//$i = 0;
//while ($i < 7) {
//    echo $i;
//    $i = $i + 1;
//    if ($i > 4) {
//        break;
//    }
//}



// постусловие , сперва выполняет код, затем проверяет (Ахтунг! выполнится хотя бы один раз)
//$i = 0;
//do {
//    echo $i;
//    $i = $i + 1;
//} while ($i < 5);


//Цикл со счетчиком
//$i = 0;
//for ($i=0; $i <= 9; $i++) {
//    echo $i;
//}



//Перебор массива
$students = ['Логинова', 'Туркова', 'Зайцев'];
foreach ($students as $st) {
    echo $st;
    echo '<br>';
}







//echo '<pre>';
//var_dump($mas[3]);
//echo '</pre>';
//echo $mas[3][2][1];

