<?php

// Циклы

$mas = array(1, 2, 3 ,4 ,5); // устарело

//$mas = [1, 2, '6' ,  ['Jktcz', '12', [12, 'олололо', [8, 12, 34]    ]   ]   ]; // так делают правильно

//$students = ['мальчики' => ['Зайцев', 'Воробьев' ],   'девочки' => [' Туркова', 'Зиновьева']  ];
$students = ['Марка' => 'тойота', 'Модель' => 'Allex', 'год' => 2005  ];

//echo $students['мальчики'][1];
echo $students['Марка'] . ' ' . $students['Модель'];


//echo '<pre>';
//var_dump($mas[3]);
//echo '</pre>';
//echo $mas[3][2][1];

